Web application/app/controllers/hotels_controller.rb

  def index
    @hotels = Hotel.all
---
SELECT "hotels".* FROM "hotels"

  def show
    @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @hotel = Hotel.new(params[:hotel])
    if @hotel.save
---
INSERT INTO "hotels" ("title", "star_rating", "breakfast_included", "room_description", "price_for_room", "address") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "sdf"], ["star_rating", 1], ["breakfast_included", "sdffd"], ["room_description", "gfdg"], ["price_for_room", 1], ["address", "dsfds"]]

  def edit
    @hotel = Hotel.find(params[:id])
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @hotel = Hotel.find(params[:id])

    if @hotel.update_attributes(permitted_params)
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "hotels" SET "star_rating" = $1 WHERE "hotels"."id" = $2  [["star_rating", 5], ["id", 1]]

  def destroy
    hotel = Hotel.find(params[:id])
    hotel.destroy
---
SELECT  "hotels".* FROM "hotels" WHERE "hotels"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "hotels" WHERE "hotels"."id" = $1  [["id", 2]]